follen99/ProgettoMisureSulleReti2025/STM32CubeExpansion_LRWAN_V2.1.0/Projects/B-L072Z-LRWAN1/Applications/SubGHz_Phy/SubGHz_Phy_PingPong/SubGHz_Phy/App/subghz_phy_app.c
/*!
 * \file      subghz_phy_app.c
 *
 * \brief     Ping-Pong implementation
 *
 * \copyright Revised BSD License, see section \ref LICENSE.
 *
 * \code
 *                ______                              _
 *               / _____)             _              | |
 *              ( (____  _____ ____ _| |_ _____  ____| |__
 *               \____ \| ___ |    (_   _) ___ |/ ___)  _ \
 *               _____) ) ____| | | || |_| ____( (___| | | |
 *              (______/|_____)_|_|_| \__)_____)\____)_| |_|
 *              (C)2013-2017 Semtech
 *
 * \endcode
 *
 * \author    Miguel Luis ( Semtech )
 *
 * \author    Gregory Cristian ( Semtech )
 */
/**
  ******************************************************************************
  *
  *          Portions COPYRIGHT 2020 STMicroelectronics
  *
  * @file    subghz_phy_app.c
  * @author  MCD Application Team
  * @brief   Application of the SubGHz_Phy Middleware
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "platform.h"
#include "sys_app.h"
#include "subghz_phy_app.h"
#include "radio.h"
#include "app_version.h"

/* USER CODE BEGIN Includes */
#include "stm32_timer.h"
#include "stm32_seq.h"
#include "utilities_def.h"
#include "app_gnss.h"
#include "gnss_data.h"
#include "gnss_parser.h"
#include <stdio.h>
#include "b-l072z-lrwan1.h"
/* USER CODE END Includes */

/* External variables ---------------------------------------------------------*/
/* USER CODE BEGIN EV */

/* USER CODE END EV */

/* Private typedef -----------------------------------------------------------*/

/* USER CODE BEGIN PTD */
typedef enum
{
  RX,
  RX_TIMEOUT,
  RX_ERROR,
  TX,
  TX_TIMEOUT,
} States_t;
/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
/* Configurations */
/*Timeout*/
#define RX_TIMEOUT_VALUE              3000
#define TX_TIMEOUT_VALUE              3000
/* PING string*/
#define GPS "GPS"
/* PONG string*/
#define ACK "ACK"
/*Size of the payload to be sent*/
/* Size must be greater of equal the PING and PONG*/
#define MAX_APP_BUFFER_SIZE          255
#if (PAYLOAD_LEN > MAX_APP_BUFFER_SIZE)
#error PAYLOAD_LEN must be less or equal than MAX_APP_BUFFER_SIZE
#endif /* (PAYLOAD_LEN > MAX_APP_BUFFER_SIZE) */
/* wait for remote to be in Rx, before sending a Tx frame*/
#define RX_TIME_MARGIN                50
/* Afc bandwidth in Hz */
#define FSK_AFC_BANDWIDTH             83333
/* LED blink Period*/
#define LED_PERIOD_MS                 200
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */
//#define MASTER = 1
/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
/* Radio events function pointer */
static RadioEvents_t RadioEvents;
/* USER CODE BEGIN PV */

/*Ping Pong FSM states */
static States_t State = RX;
/* App Rx Buffer*/
static uint8_t BufferRx[MAX_APP_BUFFER_SIZE];
/* App Tx Buffer*/
static uint8_t BufferTx[MAX_APP_BUFFER_SIZE];
/* Last  Received Buffer Size*/
uint16_t RxBufferSize = 0;
/* Last  Received packer Rssi*/
int8_t RssiValue = 0;
/* Last  Received packer SNR (in Lora modulation)*/
int8_t SnrValue = 0;
/* Led Timers objects*/
static UTIL_TIMER_Object_t timerLed;
/* device state. Master: true, Slave: false*/
//bool isMaster = true;
static int MASTER = 1;
static int buttonPressed = 0;
/* random delay to make sure 2 devices will sync*/
/* the closest the random delays are, the longer it will
   take for the devices to sync when started simultaneously*/
static int32_t random_delay;
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
/*!
 * @brief Function to be executed on Radio Tx Done event
 */
static void OnTxDone(void);

/**
  * @brief Function to be executed on Radio Rx Done event
  * @param  payload ptr of buffer received
  * @param  size buffer size
  * @param  rssi
  * @param  LoraSnr_FskCfo
  */
static void OnRxDone(uint8_t *payload, uint16_t size, int16_t rssi, int8_t LoraSnr_FskCfo);

/**
  * @brief Function executed on Radio Tx Timeout event
  */
static void OnTxTimeout(void);

/**
  * @brief Function executed on Radio Rx Timeout event
  */
static void OnRxTimeout(void);

/**
  * @brief Function executed on Radio Rx Error event
  */
static void OnRxError(void);

/* USER CODE BEGIN PFP */
/**
  * @brief  Function executed on when led timer elapses
  * @param  context ptr of LED context
  */
static void OnledEvent(void *context);

/**
  * @brief PingPong state machine implementation
  */
//static void PingPong_Process(void);
static void Master(void);
static void Slave(void);
void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin);
/* USER CODE END PFP */

/* Exported functions ---------------------------------------------------------*/
void SubghzApp_Init(void)
{
  /* USER CODE BEGIN SubghzApp_Init_1 */
  APP_LOG(TS_OFF, VLEVEL_M, "\n\rPING PONG\n\r");
  /* Print APP version*/
  APP_LOG(TS_OFF, VLEVEL_M, "APP_VERSION= V%X.%X.%X\r\n",
          (uint8_t)(__APP_VERSION >> __APP_VERSION_MAIN_SHIFT),
          (uint8_t)(__APP_VERSION >> __APP_VERSION_SUB1_SHIFT),
          (uint8_t)(__APP_VERSION >> __APP_VERSION_SUB2_SHIFT));

  /* Led Timers*/
  UTIL_TIMER_Create(&timerLed, 0xFFFFFFFFU, UTIL_TIMER_ONESHOT, OnledEvent, NULL);
  UTIL_TIMER_SetPeriod(&timerLed, LED_PERIOD_MS);
  UTIL_TIMER_Start(&timerLed);
  /* USER CODE END SubghzApp_Init_1 */

  if (MASTER == 1) {
      MX_GNSS_Init();
  }

  BSP_PB_Init(BUTTON_USER, BUTTON_MODE_EXTI);

  /* Radio initialization */
  RadioEvents.TxDone = OnTxDone;
  RadioEvents.RxDone = OnRxDone;
  RadioEvents.TxTimeout = OnTxTimeout;
  RadioEvents.RxTimeout = OnRxTimeout;
  RadioEvents.RxError = OnRxError;

  Radio.Init(&RadioEvents);

  /*calculate random delay for synchronization*/
  random_delay = (Radio.Random()) >> 22; /*10bits random e.g. from 0 to 1023 ms*/

  /* USER CODE BEGIN SubghzApp_Init_2 */
  /* Radio Set frequency */
  Radio.SetChannel(RF_FREQUENCY);

  /* Radio configuration */
#if ((USE_MODEM_LORA == 1) && (USE_MODEM_FSK == 0))
  APP_LOG(TS_OFF, VLEVEL_M, "---------------\n\r");
  APP_LOG(TS_OFF, VLEVEL_M, "LORA_MODULATION\n\r");
  APP_LOG(TS_OFF, VLEVEL_M, "LORA_BW=%d kHz\n\r", (1 << LORA_BANDWIDTH) * 125);
  APP_LOG(TS_OFF, VLEVEL_M, "LORA_SF=%d\n\r", LORA_SPREADING_FACTOR);

  Radio.SetTxConfig(MODEM_LORA, TX_OUTPUT_POWER, 0, LORA_BANDWIDTH,
                    LORA_SPREADING_FACTOR, LORA_CODINGRATE,
                    LORA_PREAMBLE_LENGTH, LORA_FIX_LENGTH_PAYLOAD_ON,
                    true, 0, 0, LORA_IQ_INVERSION_ON, TX_TIMEOUT_VALUE);

  Radio.SetRxConfig(MODEM_LORA, LORA_BANDWIDTH, LORA_SPREADING_FACTOR,
                    LORA_CODINGRATE, 0, LORA_PREAMBLE_LENGTH,
                    LORA_SYMBOL_TIMEOUT, LORA_FIX_LENGTH_PAYLOAD_ON,
                    0, true, 0, 0, LORA_IQ_INVERSION_ON, true);

  Radio.SetMaxPayloadLength(MODEM_LORA, MAX_APP_BUFFER_SIZE);

#elif ((USE_MODEM_LORA == 0) && (USE_MODEM_FSK == 1))
  APP_LOG(TS_OFF, VLEVEL_M, "---------------\n\r");
  APP_LOG(TS_OFF, VLEVEL_M, "FSK_MODULATION\n\r");
  APP_LOG(TS_OFF, VLEVEL_M, "FSK_BW=%d Hz\n\r", FSK_BANDWIDTH);
  APP_LOG(TS_OFF, VLEVEL_M, "FSK_DR=%d bits/s\n\r", FSK_DATARATE);

  Radio.SetTxConfig(MODEM_FSK, TX_OUTPUT_POWER, FSK_FDEV, 0,
                    FSK_DATARATE, 0,
                    FSK_PREAMBLE_LENGTH, FSK_FIX_LENGTH_PAYLOAD_ON,
                    true, 0, 0, 0, TX_TIMEOUT_VALUE);

  Radio.SetRxConfig(MODEM_FSK, FSK_BANDWIDTH, FSK_DATARATE,
                    0, FSK_AFC_BANDWIDTH, FSK_PREAMBLE_LENGTH,
                    0, FSK_FIX_LENGTH_PAYLOAD_ON, 0, true,
                    0, 0, false, true);

  Radio.SetMaxPayloadLength(MODEM_FSK, MAX_APP_BUFFER_SIZE);

#else
#error "Please define a modulation in the subghz_phy_app.h file."
#endif /* USE_MODEM_LORA | USE_MODEM_FSK */
  /* LED initialization*/
  LED_Init(LED_RED1);
  LED_Init(LED_RED2);
  /*fills tx buffer*/
  memset(BufferTx, 0x0, MAX_APP_BUFFER_SIZE);

  APP_LOG(TS_ON, VLEVEL_L, "rand=%d\n\r", random_delay);
  /*starts reception*/
  Radio.Rx(RX_TIMEOUT_VALUE + random_delay);
  /*register task to to be run in while(1) after Radio IT*/
  if(MASTER==1){
	  UTIL_SEQ_RegTask((1 << CFG_SEQ_Task_SubGHz_Phy_App_Master), UTIL_SEQ_RFU, Master);
	  UTIL_SEQ_RegTask((1 << CFG_SEQ_Task_GNSS), UTIL_SEQ_RFU, MX_GNSS_Process);
  }
  else{
	  UTIL_SEQ_RegTask((1 << CFG_SEQ_Task_SubGHz_Phy_App_Slave), UTIL_SEQ_RFU, Slave);
  }

  /* USER CODE END SubghzApp_Init_2 */
}

/* USER CODE BEGIN EF */

/* USER CODE END EF */

/* Private functions ---------------------------------------------------------*/

void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
{
  if (GPIO_Pin == KEY_BUTTON_PIN)
  {
    BSP_LED_Toggle(LED2);
    buttonPressed = true;               // Indico che il bottone è stato premuto
    //UTIL_SEQ_SetTask(1 << CFG_SEQ_Task_SubGHz_Phy_App_Master, CFG_SEQ_Prio_0);
    UTIL_SEQ_SetTask(1 << CFG_SEQ_Task_GNSS, CFG_SEQ_Prio_0);
    //MX_GNSS_Process();
  }
}


static void OnTxDone(void)
{
  /* USER CODE BEGIN OnTxDone */
  APP_LOG(TS_ON, VLEVEL_L, "OnTxDone\n\r");
  /* Update the State of the FSM*/
  State = TX;
  /* Run PingPong process in background*/
  if(MASTER==1){
    UTIL_SEQ_SetTask((1 << CFG_SEQ_Task_SubGHz_Phy_App_Master), CFG_SEQ_Prio_0);
  }
  else{
    UTIL_SEQ_SetTask((1 << CFG_SEQ_Task_SubGHz_Phy_App_Slave), CFG_SEQ_Prio_0);
  }
  /* USER CODE END OnTxDone */
}

static void OnRxDone(uint8_t *payload, uint16_t size, int16_t rssi, int8_t LoraSnr_FskCfo)
{
  /* USER CODE BEGIN OnRxDone */
  APP_LOG(TS_ON, VLEVEL_L, "OnRxDone\n\r");
#if ((USE_MODEM_LORA == 1) && (USE_MODEM_FSK == 0))
  APP_LOG(TS_ON, VLEVEL_L, "RssiValue=%d dBm, SnrValue=%ddB\n\r", rssi, LoraSnr_FskCfo);
  /* Record payload Signal to noise ratio in Lora*/
  SnrValue = LoraSnr_FskCfo;
#endif /* USE_MODEM_LORA | USE_MODEM_FSK */
#if ((USE_MODEM_LORA == 0) && (USE_MODEM_FSK == 1))
  APP_LOG(TS_ON, VLEVEL_L, "RssiValue=%d dBm, Cfo=%dkHz\n\r", rssi, LoraSnr_FskCfo);
  SnrValue = 0; /*not applicable in GFSK*/
#endif /* USE_MODEM_LORA | USE_MODEM_FSK */
  /* Update the State of the FSM*/
  State = RX;
  /* Clear BufferRx*/
  memset(BufferRx, 0, MAX_APP_BUFFER_SIZE);
  /* Record payload size*/
  RxBufferSize = size;
  if (RxBufferSize <= MAX_APP_BUFFER_SIZE)
  {
    memcpy(BufferRx, payload, RxBufferSize);
  }
  /* Record Received Signal Strength*/
  RssiValue = rssi;
  /* Record payload content*/
  APP_LOG(TS_ON, VLEVEL_H, "payload. size=%d \n\r", size);
  for (int i = 0; i < PAYLOAD_LEN; i++)
  {
    APP_LOG(TS_OFF, VLEVEL_H, "%02X", BufferRx[i]);
    if (i % 16 == 15)
    {
      APP_LOG(TS_OFF, VLEVEL_H, "\n\r");
    }
  }
  APP_LOG(TS_OFF, VLEVEL_H, "\n\r");
  /* Run PingPong process in background*/
  if(MASTER==1){
	  UTIL_SEQ_SetTask((1 << CFG_SEQ_Task_SubGHz_Phy_App_Master), CFG_SEQ_Prio_0);
  }
  else{
	  UTIL_SEQ_SetTask((1 << CFG_SEQ_Task_SubGHz_Phy_App_Slave), CFG_SEQ_Prio_0);
  }
  /* USER CODE END OnRxDone */
}

static void OnTxTimeout(void)
{
  /* USER CODE BEGIN OnTxTimeout */
  APP_LOG(TS_ON, VLEVEL_L, "OnTxTimeout\n\r");
  /* Update the State of the FSM*/
  State = TX_TIMEOUT;
  /* Run PingPong process in background*/
  if(MASTER==1){
    UTIL_SEQ_SetTask((1 << CFG_SEQ_Task_SubGHz_Phy_App_Master), CFG_SEQ_Prio_0);
  }
  else{
    UTIL_SEQ_SetTask((1 << CFG_SEQ_Task_SubGHz_Phy_App_Slave), CFG_SEQ_Prio_0);
  }
  /* USER CODE END OnTxTimeout */
}

static void OnRxTimeout(void)
{
  /* USER CODE BEGIN OnRxTimeout */
  APP_LOG(TS_ON, VLEVEL_L, "OnRxTimeout\n\r");
  /* Update the State of the FSM*/
  State = RX_TIMEOUT;
  /* Run PingPong process in background*/
  if(MASTER==1){
    UTIL_SEQ_SetTask((1 << CFG_SEQ_Task_SubGHz_Phy_App_Master), CFG_SEQ_Prio_0);
  }
  else{
    UTIL_SEQ_SetTask((1 << CFG_SEQ_Task_SubGHz_Phy_App_Slave), CFG_SEQ_Prio_0);
  }
  /* USER CODE END OnRxTimeout */
}

static void OnRxError(void)
{
  /* USER CODE BEGIN OnRxError */
  APP_LOG(TS_ON, VLEVEL_L, "OnRxError\n\r");
  /* Update the State of the FSM*/
  State = RX_ERROR;
  /* Run PingPong process in background*/
  if(MASTER==1){
    UTIL_SEQ_SetTask((1 << CFG_SEQ_Task_SubGHz_Phy_App_Master), CFG_SEQ_Prio_0);
  }
  else{
    UTIL_SEQ_SetTask((1 << CFG_SEQ_Task_SubGHz_Phy_App_Slave), CFG_SEQ_Prio_0);
  }
  /* USER CODE END OnRxError */
}

/* USER CODE BEGIN PrFD */

static void Master(void) {
	APP_LOG(TS_ON, VLEVEL_L, "START");
    static int gpsSent = 0;
    Radio.Sleep();

    // Ottieni i dati GNSS validi
    GNSSParser_Data_t gnss_data = {0};
    GNSS_DATA_GetValidInfo(&gnss_data);

    switch (State)
    {
        case TX:
            APP_LOG(TS_ON, VLEVEL_L, "Master: waiting for ACK...\n\r");
            Radio.Rx(RX_TIMEOUT_VALUE);
            gpsSent = 1;
            break;

        case RX:
            if (gpsSent == 1 && RxBufferSize > 0)
            {
                if (strncmp((const char *)BufferRx, ACK, sizeof(ACK) - 1) == 0)
                {
                    UTIL_TIMER_Stop(&timerLed);
                    LED_Off(LED_RED2);
                    LED_Toggle(LED_RED1);
                    APP_LOG(TS_ON, VLEVEL_L, "Master: ACK received.\n\r");
                }
                else
                {
                    APP_LOG(TS_ON, VLEVEL_L, "Master: Unexpected message.\n\r");
                }

                gpsSent = 0;
                HAL_Delay(Radio.GetWakeupTime() + RX_TIME_MARGIN + random_delay);

                if (gnss_data.gpgga_data.valid == 1)
                {
                    snprintf((char *)BufferTx, PAYLOAD_LEN, "LAT=%.5f,LON=%.5f",
                             gnss_data.gpgga_data.xyz.lat, gnss_data.gpgga_data.xyz.lon);
                    APP_LOG(TS_ON, VLEVEL_L, "Master Tx: sending coordinates\n\r");
                }
                else
                {
                    snprintf((char *)BufferTx, PAYLOAD_LEN, "GPS_NO_FIX");
                    APP_LOG(TS_ON, VLEVEL_L, "Master Tx: no GPS fix\n\r");
                }

                Radio.Send(BufferTx, PAYLOAD_LEN);
            }
            else
            {
                APP_LOG(TS_ON, VLEVEL_L, "Master: Nothing to process in RX\n\r");
            }
            break;

        case RX_TIMEOUT:
        case RX_ERROR:
        case TX_TIMEOUT:
            gpsSent = 0;
            HAL_Delay(Radio.GetWakeupTime() + RX_TIME_MARGIN + random_delay);

            if (gnss_data.gpgga_data.valid == 1)
            {
                snprintf((char *)BufferTx, PAYLOAD_LEN, "LAT=%.5f,LON=%.5f",
                         gnss_data.gpgga_data.xyz.lat, gnss_data.gpgga_data.xyz.lon);
                APP_LOG(TS_ON, VLEVEL_L, "Master retry: sending coordinates\n\r");
            }
            else
            {
                snprintf((char *)BufferTx, PAYLOAD_LEN, "GPS_NO_FIX");
                APP_LOG(TS_ON, VLEVEL_L, "Master retry: no GPS fix\n\r");
            }

            Radio.Send(BufferTx, PAYLOAD_LEN);
            break;

        default:
            break;
    }
}

static void Slave(void) {
    Radio.Sleep();

    switch (State)
    {
        case RX:
            if (RxBufferSize > 0)
            {
                // Controlla se è un messaggio GPS o un "GPS_NO_FIX"
                if (strncmp((const char *)BufferRx, "LAT=", 4) == 0 ||
                    strncmp((const char *)BufferRx, "GPS_NO_FIX", 10) == 0)
                {
                    // Messaggio GPS ricevuto
                    UTIL_TIMER_Stop(&timerLed);
                    LED_Off(LED_RED1);
                    LED_Toggle(LED_RED2);
                    APP_LOG(TS_ON, VLEVEL_L, "Slave: GPS data received: %s\n\r", BufferRx);

                    // Qui puoi aggiungere codice per elaborare BufferRx, es:
                    // parsing delle coordinate, salvataggio, ecc.

                    // Attesa prima di inviare l'ACK
                    uint32_t ackDelay = 200 + (rand() % 100); // 200-299 ms casuali
                    HAL_Delay(Radio.GetWakeupTime() + RX_TIME_MARGIN + ackDelay);

                    // Invia ACK
                    memcpy(BufferTx, ACK, sizeof(ACK) - 1);
                    Radio.Send(BufferTx, PAYLOAD_LEN);
                }
                else
                {
                    // Messaggio inatteso
                    APP_LOG(TS_ON, VLEVEL_L, "Slave: Unexpected message: %s\n\r", BufferRx);
                    Radio.Rx(RX_TIMEOUT_VALUE);
                }
            }
            else
            {
                APP_LOG(TS_ON, VLEVEL_L, "Slave: Empty buffer. Listening again...\n\r");
                Radio.Rx(RX_TIMEOUT_VALUE);
            }
            break;

        case TX:
            // Dopo aver inviato ACK, torna in ascolto
            APP_LOG(TS_ON, VLEVEL_L, "Slave: ACK sent. Listening...\n\r");
            Radio.Rx(RX_TIMEOUT_VALUE);
            break;

        case RX_TIMEOUT:
        case RX_ERROR:
            APP_LOG(TS_ON, VLEVEL_L, "Slave: Timeout or error. Listening again...\n\r");
            Radio.Rx(RX_TIMEOUT_VALUE);
            break;

        case TX_TIMEOUT:
            APP_LOG(TS_ON, VLEVEL_L, "Slave: TX timeout. Listening again...\n\r");
            Radio.Rx(RX_TIMEOUT_VALUE);
            break;

        default:
            break;
    }
}




static void OnledEvent(void *context)
{
  LED_Toggle(LED_RED1);
  LED_Toggle(LED_RED2);
  UTIL_TIMER_Start(&timerLed);
}

/* USER CODE END PrFD */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
